Wijmeers/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            groovyBC;
	value 		uniform (0 0 0);
        lookuptables (
        {
            name hLookup;
            outOfBounds clamp;
            fileName "$FOAM_CASE/H7.88h.V2500";
            file     "$FOAM_CASE/H7.88h.V2500";
	}
	{
            name uLookup;
            outOfBounds clamp;
            fileName "$FOAM_CASE/H7.88u.V2500";
            file     "$FOAM_CASE/H7.88u.V2500";
        }
        );
	valueExpression "pos().y < hLookup(time()) ? vector(uLookup(time()), 0, 0) : vector(0, 0, 0)";
    }
    outlet
    {
        type 		zeroGradient;
    }
    bottom
    {
        type            noSlip;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
