Wijmeers/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (0   7.88 -0.10)  //0
    (3   7.88 -0.10)  //1
    (9   4.35 -0.10)  //2
    (11  4.35 -0.10)  //3
    (0   8.87 -0.10)  //0
    (3   8.87 -0.10)  //1
    (9   5.34 -0.10)  //2
    (11  5.34 -0.10)  //3

    (0   7.88 0.10)  //0
    (3   7.88 0.10)  //1
    (9   4.35 0.10)  //2
    (11  4.35 0.10)  //3
    (0   8.87 0.10)  //0
    (3   8.87 0.10)  //1
    (9   5.34 0.10)  //2
    (11  5.34 0.10)  //3

);

blocks
(
    hex (0 1 5 4  8  9 13 12) (188 63 1) simpleGrading (1 1 1)
    hex (1 2 6 5  9 10 14 13) (375 63 1) simpleGrading (1 1 1)
    hex (2 3 7 6 10 11 15 14) (125 63 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 11 15 7)
        );
    }
   atmosphere
    {
        type patch;
        faces
        (
            (4 5 13 12)
	    (5 6 14 13)
	    (6 7 15 14)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }
/*    front
    {
	type empty;
        faces
        (
        (0 1 3 2)
        (2 3 5 4)
	);
    }
    
    back
    {	type empty;
        faces
        (
           (6 7 9 8)
           (8 9 11 10)
	);
    }
*/
);

mergePatchPairs
(
);

// ************************************************************************* //
