Wijmeers/system/samplePressureSurface
type		surfaceFieldValue;
libs		("libfieldFunctionObjects.so");

writeControl 	writeTime;
writeFields	true;

surfaceFormat   raw;
regionType	patch;
name		bottom;

operation	none;

fields
(
	p
	alpha.water
);
